c5/src/InformationRegisters/UsersAndGroupsDocuments/UsersAndGroupsDocuments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersAndGroupsDocuments</name>
  <dimensions>
    <name>UserGroup</name>
    <comment>Нельзя использовать имя Group</comment>
    <type>
      <types>CatalogRef.UserGroupsDocuments</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

c5/src/CommonModules/DocumentsNotifications/Module.bsl
Procedure Send ( Document, Receivers, Comment ) export
	
	env = getFields ( Document, Comment );
	getAddresses ( env, Receivers );
	if ( env.Addresses.Count () = 0 ) then
		return;
	endif; 
	profile = MailboxesSrv.SystemProfile ();
	message = getMessage ( env );
	try
		MailboxesSrv.Post ( profile, message );
	except
		WriteLogEvent ( "MailboxesSrv.Post", EventLogLevel.Error, Metadata.Documents.Document, Env.Document, ErrorDescription () );
	endtry
	
EndProcedure

Function getFields ( Document, Comment )
	
	fields = DF.Values ( Document, "Creator, Subject, Book.Description" );
	fields.Insert ( "Document", Document );
	fields.Insert ( "Comment", Comment );
	return fields;
	
EndFunction 

Procedure getAddresses ( Env, Receivers )
	
	addresses = getUsersAndGroups ( Receivers );
	parts = new Array ();
	if ( addresses.Everybody ) then
		parts.Add ( "
		|select Users.Description as User, Users.Email as Email
		|from Catalog.Users as Users
		|where not Users.DeletionMark
		|and not Users.AccessDenied
		|and not Users.AccessRevoked
		|and Users.Ref <> &Creator
		|" );
	else
		if ( addresses.Users.Count () > 0 ) then
			parts.Add ( "
			|select Users.Description as User, Users.Email as Email
			|from Catalog.Users as Users
			|where Users.Ref in ( &Users )
			|and not Users.DeletionMark
			|and not Users.AccessDenied
			|and not Users.AccessRevoked
			|and Users.Ref <> &Creator
			|" );
		endif; 
		if ( addresses.Groups.Count () > 0 ) then
			parts.Add ( "
			|select Users.User.Description as User, Users.User.Email as Email
			|from InformationRegister.UsersAndGroupsDocuments as Users
			|where Users.UserGroup in ( &Groups )
			|and not Users.User.DeletionMark
			|and not Users.UserGroup.DeletionMark
			|and not Users.User.AccessDenied
			|and not Users.User.AccessRevoked
			|and Users.User.Ref <> &Creator
			|" );
		endif; 
	endif; 
	q = new Query ( StrConcat ( parts, " union " ) );
	q.SetParameter ( "Users", addresses.Users );
	q.SetParameter ( "Groups", addresses.Groups );
	q.SetParameter ( "Creator", Env.Creator );
	Env.Insert ( "Addresses", q.Execute ().Unload () );
	
EndProcedure

Function getUsersAndGroups ( Receivers )
	
	result = new Structure ( "Everybody, Users, Groups", false, new Array (), new Array () );
	result.Everybody = Receivers.Find ( Catalogs.UserGroupsDocuments.Everybody ) <> undefined;
	if ( result.Everybody ) then
		return result;
	endif; 
	typeUser = Type ( "CatalogRef.Users" );
	for each receiver in Receivers do
		if ( TypeOf ( receiver ) = typeUser ) then
			result.Users.Add ( receiver );
		else
			result.Groups.Add ( receiver );
		endif; 
	enddo; 
	return result;
	
EndFunction 

Function getMessage ( Env )
	
	message = new InternetMailMessage ();
	message.From = Cloud.Noreply ();
	for each row in Env.Addresses do
		address = message.To.Add ( row.Email );
		address.DisplayName = row.User;
	enddo; 
	message.Subject = ? ( Env.BookDescription = null, "", Env.BookDescription + ", " ) + Env.Subject;
	p = new Structure ();
	p.Insert ( "User", SessionParameters.User );
	p.Insert ( "Subject", Env.Subject );
	p.Insert ( "URL", Conversion.ObjectToURL ( Env.Document ) );
	if ( IsBlankString ( Env.Comment ) ) then
		comment = "";
	else
		comment = Chars.LF + Output.CreatorComment ( new Structure ( "Comment", Env.Comment ) ) + Chars.LF;
	endif; 
	p.Insert ( "Comment", comment );
	message.Texts.Add ( Output.SubscriptionNotificationBody ( p ) );
	return message;
	
EndFunction
